# 3.Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
s1 = input("Введите первую строку: ")
s2 = input("Введите вторую строку: ")
a = s1.count(s2)
print(f"Количество вхождений одной строки в другой {a}")
